Revit 2024 API
MetallicPaint.MetallicpaintFinish Property
 The property labeled "Finish" from the "MetallicPaint" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.1
Syntax
C#
public static string MetallicpaintFinish { get; }
Visual Basic
Public Shared ReadOnly Property MetallicpaintFinish As String
	Get
Visual C++
public:
static property String^ MetallicpaintFinish {
	String^ get ();
}
Remarks
 This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MetallicpaintFinishType".
See Also
MetallicPaint Class
Autodesk.Revit.DB.Visual Namespace